_Rarzrabotki/Rarus/USO2/DataProcessors/СМ_ОбменESTML.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<DataProcessor>
		<Properties>
			<Name>СМ_ОбменESTML</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПутьСохранения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПутьКФайлу</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ОтборСмет</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЛокальнаяСмета</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.СМ_ЛокальнаяСмета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/InformationRegisters/СМ_СтоимостьРесурсовПозиции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>СМ_СтоимостьРесурсовПозиции</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>25</v8:Digits>
							<v8:FractionDigits>10</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормаРасхода</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>25</v8:Digits>
							<v8:FractionDigits>10</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтоимостьБазисная</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтоимостьЗМБазисная</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтоимостьТекущая</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтоимостьТекущаяЗМ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>НомерСтрокиДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Смета</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СМ_АктВыполненныхРабот</v8:Type>
						<v8:Type>cfg:DocumentRef.СМ_ЛокальнаяСмета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Раздел</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СМ_РазделЛокальнойСметы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Позиция</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СМ_ПозицияЛокальнойСметы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Ресурс</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СМ_Ресурсы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НаименованиеРесурса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатусРесурса</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СМ_ОбеспечениеРесурса</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/InformationRegisters/СМ_ИтогиПоГлавам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>СМ_ИтогиПоГлавам</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВозвратМатер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗарплМашин</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗатратыТрудаМашин</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗатратыТрудаРабочих</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Оборуд</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОснЗарплата</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПрямЗатраты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтоимМатер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекВозвратМатер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекЗарплМашин</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекОборуд</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекОснЗарплата</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекПрямЗатраты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекСтоимМатер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекЭксплМашин</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЭксплМашин</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОборудЗаказчика</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекОборудЗаказчика</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтоимПоПрайсам</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекСтоимПоПрайсам</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Смета</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СМ_АктВыполненныхРабот</v8:Type>
						<v8:Type>cfg:DocumentRef.СМ_ЛокальнаяСмета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Глава</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СМ_ГлавыССРС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Итог</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СМ_ИтогиПоГлавам</v8:Type>
						<v8:Type>cfg:CatalogRef.СМ_ЛимитированныеЗатраты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидРабот</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СМ_ВидыЗатратСмета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/InformationRegisters/СМ_Файлы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>СМ_Файлы</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Файл</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИмяФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Enums/СМ_ТипыЗначенийЛимитированныхЗатрат.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>СМ_ТипыЗначенийЛимитированныхЗатрат</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Процент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Коэффициент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Сумма</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Индекс</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Enums/СМ_МетодыРасчетаЛС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>СМ_МетодыРасчетаЛС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>БазисноИндексный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ресурсный</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Enums/СМ_УровеньЗаданияИндексов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>СМ_УровеньЗаданияИндексов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Расценка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Раздел</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Смета</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Enums/СМ_СпособыРасчетаИндексов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>СМ_СпособыРасчетаИндексов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>КПолнойСтоимости</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоЭлементамЗатрат</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Enums/СМ_СтатусыСметныхДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>СМ_СтатусыСметныхДокументов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Архив</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Проект</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РедактированиеЦен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Согласован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Черновик</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Enums/СМ_ТипыПоправок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>СМ_ТипыПоправок</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ДемонтажМДС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УсловияПроизводстваРаботМДС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТехчастиСборников</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/DataProcessors/СМ_ОбменESTML/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область Выгрузка

// // // // // // Выгрузка// // // // // // // /

// Процедура выгружает Локальные сметы в каталог, каждой смете соответствует свой файл. 
// ПАРАМЕТРЫ:
// // МассивСмет - массив ссылок для выборки смет
// // Путь - каталог для сохранения файлов.
Процедура ВыгрузитьНаСервере(Путь,МассивСмет,АдресФайлаВоВременномХранилище = "",ИмяВременногоФайла = "",ЭтоВеб = Ложь)  Экспорт
	estml = ФабрикаXDTO.Создать(ФабрикаXDTO.Тип("http://www.estml.ru/estml20.xsd", "estml"));
	ТипЛС = ФабрикаXDTO.Тип("http://www.estml.ru/estml20.xsd", "ЛокальнаяСмета");
	
	АдресФайлаВоВременномХранилище = Новый Соответствие;		
	
	Для Каждого СтрокаЛС Из МассивСмет Цикл
		// Выгружаем через XDTO  
		ЗаписьXML  = Новый ЗаписьXML;
		Номер = Строка(СтрокаЛС.НомерСметы);
		ИмяФайла = ОбщегоНазначенияКлиентСервер.ЗаменитьНедопустимыеСимволыВИмениФайла(Номер,"_");
		Если ЭтоВеб Тогда
			ЗаписьXML.ОткрытьФайл(Путь+"\smeta_"+ИмяФайла+".estml", "UTF-8");
		Иначе
			ЗаписьXML.ОткрытьФайл(ИмяВременногоФайла,"UTF-8");  		
		КонецЕсли;
		ЗаписьXML.ЗаписатьОбъявлениеXML();
		
		ЛССтрокаXDTO = ФабрикаXDTO.Создать(ТипЛС);
		ЛССтрокаXDTO.Номер = ЗаполнитьЗначениеСтрокТипа(СтрокаЛС.НомерСметы);
		ЛССтрокаXDTO.Дата = ЗаполнитьЗначениеСтрокТипа(Формат(СтрокаЛС.Дата,"ДФ=dd.MM.yyyy"));
		Составил = СтрокаЛС.Подписи.Найти("Составил","Статус");
		Если Не Составил=Неопределено Тогда
			ЛССтрокаXDTO.Составил = ЗаполнитьЗначениеСтрокТипа(Составил.ФИО);
		КонецЕсли;
		Проверил = СтрокаЛС.Подписи.Найти("Проверил","Статус");
		Если Не Проверил=Неопределено Тогда
			ЛССтрокаXDTO.Проверил = ЗаполнитьЗначениеСтрокТипа(Проверил.ФИО);
		КонецЕсли;
		ЛССтрокаXDTO.Объект = ЗаполнитьЗначениеОбъект(СтрокаЛС);
		Если ЗначениеЗаполнено(СтрокаЛС.Заказчик) Тогда
			ЛССтрокаXDTO.Заказчик = ЗаполнитьЗначениеОрганизации(СтрокаЛС.Заказчик);
		КонецЕсли;
		Если ЗначениеЗаполнено(СтрокаЛС.Подрядчик) Тогда
			ЛССтрокаXDTO.Подрядчик = ЗаполнитьЗначениеОрганизации(СтрокаЛС.Подрядчик);
		КонецЕсли;
		Если ЗначениеЗаполнено(СтрокаЛС.Организация) Тогда
			ЛССтрокаXDTO.ПроектнаяОрганизация = ЗаполнитьЗначениеОрганизации(СтрокаЛС.Организация);
		КонецЕсли;
		Если ЗначениеЗаполнено(СтрокаЛС.Инвестор) Тогда
			ЛССтрокаXDTO.Инвестор = ЗаполнитьЗначениеОрганизации(СтрокаЛС.Инвестор);
		КонецЕсли;
		
		Затраты = ПолучитьИтогиЗатрат(СтрокаЛС,"ЗНАЧЕНИЕ(Справочник.СМ_ИтогиПоСмете.ВсегоПоСмете)");
		НР = ПолучитьИтогиЗатрат(СтрокаЛС,"ЗНАЧЕНИЕ(Справочник.СМ_ИтогиПоСмете.НаклРасх)");
		СП = ПолучитьИтогиЗатрат(СтрокаЛС,"ЗНАЧЕНИЕ(Справочник.СМ_ИтогиПоСмете.СметПрибыль)");
		
		ЛССтрокаXDTO.ЗП = ЗаполнитьЗначениеЧислоТипа(?(Затраты=0,0,Затраты.ЗП));
		ЛССтрокаXDTO.ЭМ = ЗаполнитьЗначениеЧислоТипа(?(Затраты=0,0,Затраты.ЭМ));
		ЛССтрокаXDTO.ЗПМ = ЗаполнитьЗначениеЧислоТипа(?(Затраты=0,0,Затраты.ЗПМ));
		ЛССтрокаXDTO.МР = ЗаполнитьЗначениеЧислоТипа(?(Затраты=0,0,Затраты.МР));
		ЛССтрокаXDTO.ЗТР = ЗаполнитьЗначениеЧислоТипа(?(Затраты=0,0,Затраты.ЗТР));
		ЛССтрокаXDTO.ЗТМ = ЗаполнитьЗначениеЧислоТипа(?(Затраты=0,0,Затраты.ЗТМ));
		ЛССтрокаXDTO.Мусор = ЗаполнитьЗначениеЧислоТипа(0);
		ЛССтрокаXDTO.НР = ЗаполнитьЗначениеЧислоТипа(?(НР=0,0,НР.ПЗ));
		ЛССтрокаXDTO.СП = ЗаполнитьЗначениеЧислоТипа(?(НР=0,0,СП.ПЗ));
		ЛССтрокаXDTO.Итого = ЗаполнитьЗначениеЧислоТипа(?(Затраты=0,0,Затраты.ПЗ));
		ЛССтрокаXDTO.Неуч = ЗаполнитьЗначениеЧислоТипа(0);
		СНБ = Справочники.СМ_СметноНормативныеБазы.НайтиПоКоду(СтрокаЛС.КодРегионаФайлаИндексовПересчета);
		Если Не СНБ.Пустая() Тогда
			ЛССтрокаXDTO.Индексы = ЗаполнитьЗначениеИндексов(СНБ,СтрокаЛС);
		КонецЕсли;
		ЛССтрокаXDTO.Строительство = ПолучитьИтогиВидыРабот(СтрокаЛС,"ЗНАЧЕНИЕ(Справочник.СМ_ИтогиСметыПоВидамРабот.СтроитРаб)");
		ЛССтрокаXDTO.Монтаж = ПолучитьИтогиВидыРабот(СтрокаЛС,"ЗНАЧЕНИЕ(Справочник.СМ_ИтогиСметыПоВидамРабот.МонтажнРаб)");
		ЛССтрокаXDTO.Оборудование = ПолучитьИтогиВидыРабот(СтрокаЛС,"ЗНАЧЕНИЕ(Справочник.СМ_ИтогиСметыПоВидамРабот.Оборуд)");
		ЛССтрокаXDTO.Прочее = ПолучитьИтогиВидыРабот(СтрокаЛС,"ЗНАЧЕНИЕ(Справочник.СМ_ИтогиСметыПоВидамРабот.ПрочРаб)");
		ЛССтрокаXDTO.Возврат = ЗаполнитьЗначениеЧислоТипа(0);
		
		Итого = ЛССтрокаXDTO.Строительство.__content+ЛССтрокаXDTO.Монтаж.__content+ЛССтрокаXDTO.Оборудование.__content+ЛССтрокаXDTO.Прочее.__content;
		ЛССтрокаXDTO.ИтогоНачислений = ЗаполнитьЗначениеЧислоТипа(Итого);
		
		Если ПолучитьФункциональнуюОпцию("СМ_ИспользованиеУчетаВыполненныхРабот") Тогда
			ВыборкаАктов = НайтиАкты(СтрокаЛС);
			Пока ВыборкаАктов.Следующий() Цикл
				АктXDTO = ЗаполнитьЗначениеАкт(ВыборкаАктов.Ссылка); 
				ЛССтрокаXDTO.Акт.Добавить(АктXDTO);
			КонецЦикла;
		КонецЕсли;
		
		ВыборкаРазделов = НайтиРазделы(СтрокаЛС);
		Пока ВыборкаРазделов.Следующий() Цикл
			РазделXDTO = ЗаполнитьЗначениеРаздел(ВыборкаРазделов,СтрокаЛС); 
			ЛССтрокаXDTO.Раздел.Добавить(РазделXDTO);
		КонецЦикла;

		Для каждого Начисление Из СтрокаЛС.ЛимитированныеЗатраты Цикл
			НачислениеXDTO = ЗаполнитьЗначениеНачисление(Начисление,СтрокаЛС); 
			ЛССтрокаXDTO.Начисление.Добавить(НачислениеXDTO);
		КонецЦикла;

		
		estml.ЛокальнаяСмета = ЛССтрокаXDTO;
		ФабрикаXDTO.ЗаписатьXML(ЗаписьXML, estml);
		ЗаписьXML.Закрыть();
		Если Не ЭтоВеб Тогда
			ДвоичныеДанные = Новый ДвоичныеДанные(ИмяВременногоФайла);
			АдресФайла = ПоместитьВоВременноеХранилище(ДвоичныеДанные, Новый УникальныйИдентификатор);
			АдресФайлаВоВременномХранилище.Вставить("\smeta_"+ИмяФайла+".estml",АдресФайла);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Функция ЗаполнитьЗначениеАкт(Акт) 
	Тип = ФабрикаXDTO.Тип("http://www.estml.ru/estml20.xsd", "Акт");
	АктXDTO = ФабрикаXDTO.Создать(Тип);
	АктXDTO.Наименование = ЗаполнитьЗначениеСтрокТипа(Акт.ЛокальнаяСмета.Наименование);
	АктXDTO.Дата = ЗаполнитьЗначениеСтрокТипа(Акт.Дата);
	Составил = Акт.Подписи.Найти("Составил","Статус");
	Если Не Составил=Неопределено Тогда
		АктXDTO.Составил = ЗаполнитьЗначениеСтрокТипа(Составил.ФИО);
	КонецЕсли;
	Проверил = Акт.Подписи.Найти("Проверил","Статус");
	Если Не Проверил=Неопределено Тогда
		АктXDTO.Проверил = ЗаполнитьЗначениеСтрокТипа(Проверил.ФИО);
	КонецЕсли;
	АктXDTO.Объект = ЗаполнитьЗначениеОбъект(Акт);
	АктXDTO.Заказчик = ЗаполнитьЗначениеОрганизации(Акт.Заказчик);
	АктXDTO.Подрядчик = ЗаполнитьЗначениеОрганизации(Акт.Подрядчик);
	АктXDTO.Инвестор = ЗаполнитьЗначениеОрганизации(Акт.Инвестор);

	Затраты = ПолучитьИтогиЗатрат(Акт,"ЗНАЧЕНИЕ(Справочник.СМ_ИтогиПоСмете.ВсегоПоСмете)");
	НР = ПолучитьИтогиЗатрат(Акт,"ЗНАЧЕНИЕ(Справочник.СМ_ИтогиПоСмете.НаклРасх)");
	СП = ПолучитьИтогиЗатрат(Акт,"ЗНАЧЕНИЕ(Справочник.СМ_ИтогиПоСмете.СметПрибыль)");
	
	АктXDTO.ЗП = ЗаполнитьЗначениеЧислоТипа(?(Затраты=0,0,Затраты.ЗП));
	АктXDTO.ЭМ = ЗаполнитьЗначениеЧислоТипа(?(Затраты=0,0,Затраты.ЭМ));
	АктXDTO.ЗПМ = ЗаполнитьЗначениеЧислоТипа(?(Затраты=0,0,Затраты.ЗПМ));
	АктXDTO.МР = ЗаполнитьЗначениеЧислоТипа(?(Затраты=0,0,Затраты.МР));
	АктXDTO.ЗТР = ЗаполнитьЗначениеЧислоТипа(?(Затраты=0,0,Затраты.ЗТР));
	АктXDTO.ЗТМ = ЗаполнитьЗначениеЧислоТипа(?(Затраты=0,0,Затраты.ЗТМ));
	АктXDTO.Мусор = ЗаполнитьЗначениеЧислоТипа(0);
	АктXDTO.НР = ЗаполнитьЗначениеЧислоТипа(?(НР=0,0,НР.ПЗ));
	АктXDTO.СП = ЗаполнитьЗначениеЧислоТипа(?(НР=0,0,СП.ПЗ));
	АктXDTO.Итого = ЗаполнитьЗначениеЧислоТипа(?(Затраты=0,0,Затраты.ПЗ));
	АктXDTO.Неуч = ЗаполнитьЗначениеЧислоТипа(0);
	
	АктXDTO.Строительство = ПолучитьИтогиВидыРабот(Акт,"ЗНАЧЕНИЕ(Справочник.СМ_ИтогиСметыПоВидамРабот.СтроитРаб)");
	АктXDTO.Монтаж = ПолучитьИтогиВидыРабот(Акт,"ЗНАЧЕНИЕ(Справочник.СМ_ИтогиСметыПоВидамРабот.МонтажнРаб)");
	АктXDTO.Оборудование = ПолучитьИтогиВидыРабот(Акт,"ЗНАЧЕНИЕ(Справочник.СМ_ИтогиСметыПоВидамРабот.Оборуд)");
	АктXDTO.Прочее = ПолучитьИтогиВидыРабот(Акт,"ЗНАЧЕНИЕ(Справочник.СМ_ИтогиСметыПоВидамРабот.ПрочРаб)");
	АктXDTO.Возврат = ЗаполнитьЗначениеЧислоТипа(0);
	
	Итого = АктXDTO.Строительство.__content+АктXDTO.Монтаж.__content+АктXDTO.Оборудование.__content+АктXDTO.Прочее.__content;
	АктXDTO.ИтогоНачислений = ЗаполнитьЗначениеЧислоТипа(Итого);

	Для каждого Раздел Из Акт.Разделы Цикл
		РазделXDTO = ЗаполнитьЗначениеРаздел(Раздел,Акт); 
		АктXDTO.Раздел.Добавить(РазделXDTO);
	КонецЦикла;
	
	Для каждого Начисление Из Акт.ЛимитированныеЗатраты Цикл
		НачислениеXDTO = ЗаполнитьЗначениеНачисление(Начисление,Акт); 
		АктXDTO.Начисление.Добавить(НачислениеXDTO);
	КонецЦикла;

	
	Возврат АктXDTO;	
КонецФункции

Функция ЗаполнитьЗначениеНачисление(Начисление,АктСмета) 
	Тип = ФабрикаXDTO.Тип("http://www.estml.ru/estml20.xsd", "СметаНачисление");
	НачислениеXDTO = ФабрикаXDTO.Создать(Тип);
	НачислениеXDTO.Наименование = ЗаполнитьЗначениеСтрокТипа(Начисление.ЛимитированнаяЗатрата.Наименование);
	Если  Начисление.ЛимитированнаяЗатрата.ТипЗначенияЗатраты = Перечисления.СМ_ТипыЗначенийЛимитированныхЗатрат.Процент Тогда
		Ставка = (Начисление.ЗначениеЛимЗатраты/100)+1;
	ИначеЕсли Начисление.ЛимитированнаяЗатрата.ТипЗначенияЗатраты = Перечисления.СМ_ТипыЗначенийЛимитированныхЗатрат.Коэффициент Тогда
		Ставка = Начисление.ЗначениеЛимЗатраты+1;
	ИначеЕсли Начисление.ЛимитированнаяЗатрата.ТипЗначенияЗатраты = Перечисления.СМ_ТипыЗначенийЛимитированныхЗатрат.Индекс Тогда
		Ставка = Начисление.ЗначениеЛимЗатраты;
	Иначе
		Ставка = 1;
	КонецЕсли;
	НачислениеXDTO.Ставка = ЗаполнитьЗначениеЧислоТипа(Ставка);
	НачислениеXDTO.Значение = ЗаполнитьЗначениеЧислоТипа(Начисление.ЗначениеЛимЗатраты);
	Итог = ПолучитьИтогНачисления(Начисление.ЛимитированнаяЗатрата,АктСмета);
	НачислениеXDTO.Итог = ЗаполнитьЗначениеЧислоТипа(Итог);
	Возврат НачислениеXDTO;	
КонецФункции

Функция ЗаполнитьЗначениеРаздел(СтрокаРаздел,АктСмета)
	
	Тип = ФабрикаXDTO.Тип("http://www.estml.ru/estml20.xsd", "Раздел");
	РазделXDTO = ФабрикаXDTO.Создать(Тип);
	РазделXDTO.Наименование = ЗаполнитьЗначениеСтрокТипа(СтрокаРаздел.Раздел.НаименованиеДляПечати);
	Затраты = ПолучитьИтогиЗатратРаздела(СтрокаРаздел.Раздел,АктСмета,"ЗНАЧЕНИЕ(Справочник.СМ_ИтогиПоРазделу.ВсегоПоРазделу)");
	НР = ПолучитьИтогиЗатратРаздела(СтрокаРаздел.Раздел,АктСмета,"ЗНАЧЕНИЕ(Справочник.СМ_ИтогиПоРазделу.НаклРасх)");
	СП = ПолучитьИтогиЗатратРаздела(СтрокаРаздел.Раздел,АктСмета,"ЗНАЧЕНИЕ(Справочник.СМ_ИтогиПоРазделу.СметПрибыль)");
	
	РазделXDTO.ЗП = ЗаполнитьЗначениеЧислоТипа(?(Затраты=0,0,Затраты.ЗП));
	РазделXDTO.ЭМ = ЗаполнитьЗначениеЧислоТипа(?(Затраты=0,0,Затраты.ЭМ));
	РазделXDTO.ЗПМ = ЗаполнитьЗначениеЧислоТипа(?(Затраты=0,0,Затраты.ЗПМ));
	РазделXDTO.МР = ЗаполнитьЗначениеЧислоТипа(?(Затраты=0,0,Затраты.МР));
	РазделXDTO.ЗТР = ЗаполнитьЗначениеЧислоТипа(?(Затраты=0,0,Затраты.ЗТР));
	РазделXDTO.ЗТМ = ЗаполнитьЗначениеЧислоТипа(?(Затраты=0,0,Затраты.ЗТМ));
	РазделXDTO.Мусор = ЗаполнитьЗначениеЧислоТипа(0);
	РазделXDTO.НР = ЗаполнитьЗначениеЧислоТипа(?(НР=0,0,НР.ПЗ));
	РазделXDTO.СП = ЗаполнитьЗначениеЧислоТипа(?(НР=0,0,СП.ПЗ));
	РазделXDTO.Итого = ЗаполнитьЗначениеЧислоТипа(?(Затраты=0,0,Затраты.ПЗ));
	РазделXDTO.Неуч = ЗаполнитьЗначениеЧислоТипа(0);
	
	РазделXDTO.ИтогоНачислений = ЗаполнитьЗначениеЧислоТипа(?(Затраты=0,0,Затраты.ПЗ));
	
    ВыборкаРасценок =  НайтиРасценки(СтрокаРаздел.Раздел);
	Пока ВыборкаРасценок.Следующий() Цикл
		Если ТипЗнч(АктСмета) = Тип("ДокументСсылка.СМ_АктВыполненныхРабот") Тогда
			СтрРасценки = АктСмета.Позиции.Найти(ВыборкаРасценок.Ссылка,"Позиция");
			Если СтрРасценки = Неопределено Тогда
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		РасценкаXDTO = ЗаполнитьЗначениеРасценка(ВыборкаРасценок.Ссылка,АктСмета); 
		РазделXDTO.Расценка.Добавить(РасценкаXDTO);
	КонецЦикла;
	

	Возврат РазделXDTO;
КонецФункции

Функция ЗаполнитьЗначениеРасценка(Расценка,АктСмета)
	
	Тип = ФабрикаXDTO.Тип("http://www.estml.ru/estml20.xsd", "Расценка");
	РасценкаXDTO = ФабрикаXDTO.Создать(Тип);
	РасценкаXDTO.Шифр = ЗаполнитьЗначениеСтрокТипа(Расценка.ШифрРасценки);
	РасценкаXDTO.Наименование = ЗаполнитьЗначениеСтрокТипа(Расценка.Наименование);
	Если ТипЗнч(АктСмета) = Тип("ДокументСсылка.СМ_АктВыполненныхРабот") Тогда
		СтрРасценки = АктСмета.Позиции.Найти(Расценка,"Позиция");
		Объем = СтрРасценки.ФактОбъем;
	Иначе
		Объем = Расценка.ОбъемРабот;
	КонецЕсли;
	РасценкаXDTO.Количество = ЗаполнитьЗначениеЧислоТипа(Объем);
	РасценкаXDTO.ЕдИзм = ЗаполнитьЗначениеСтрокТипа(Расценка.ЕдиницаИзмерения.Наименование);
	Если Расценка.ИДСметы.МетодРасчета = Перечисления.СМ_МетодыРасчетаЛС.Ресурсный Тогда
		Затраты = ПолучитьИтогиЗатратПозиции(Расценка);
		ЗП = ?(Затраты=0,0,Затраты.ЗП);
		ЭМ = ?(Затраты=0,0,Затраты.ЭМ);
		ЗПМ = ?(Затраты=0,0,Затраты.ЗПМ);
		МР = ?(Затраты=0,0,Затраты.МР);
		ЗТР = ?(Затраты=0,0,Затраты.ЗТР);
		ЗТМ = ?(Затраты=0,0,Затраты.ЗТМ);
		ПЗ = ?(Затраты=0,0,Затраты.ПЗ);
		Оборудование = ?(Затраты=0,0,Затраты.Оборудование);
	Иначе
		ЗП = Расценка.ОснЗарплата;
		ЭМ = Расценка.ЭксплМашин;
		ЗПМ = Расценка.ТекущаяЗарплатаМашинистов;
		МР = Расценка.СтоимМатериалов;
		ЗТР = Расценка.ЗатратыТрудаРабочих;
		ЗТМ = Расценка.ЗатратыТрудаМашинистов;
		ПЗ = Расценка.ПрямЗатраты;
		Оборудование = Расценка.Оборудование;
	КонецЕсли;
	
	НРСП = ПолучитьИтогиЗатратПозицииНРиСП(Расценка);
	
	НРПЗ = Расценка.НакладныеРасходыТекущие;
	СППЗ = Расценка.СметнаяПрибыльТекущие;

	
	РасценкаXDTO.ЗП = ЗаполнитьЗначениеЧислоТипа(ЗП);
	РасценкаXDTO.ЭМ = ЗаполнитьЗначениеЧислоТипа(ЭМ);
	РасценкаXDTO.ЗПМ = ЗаполнитьЗначениеЧислоТипа(ЗПМ);
	РасценкаXDTO.МР = ЗаполнитьЗначениеЧислоТипа(МР);
	РасценкаXDTO.ЗТР = ЗаполнитьЗначениеЧислоТипа(ЗТР);
	РасценкаXDTO.ЗТМ = ЗаполнитьЗначениеЧислоТипа(ЗТМ);
	РасценкаXDTO.Мусор = ЗаполнитьЗначениеЧислоТипа(0);
	РасценкаXDTO.НР = ЗаполнитьЗначениеЧислоТипа(НРПЗ);
	РасценкаXDTO.СП = ЗаполнитьЗначениеЧислоТипа(СППЗ);
	РасценкаXDTO.Всего = ЗаполнитьЗначениеЧислоТипа(ПЗ);
	РасценкаXDTO.Неуч = ЗаполнитьЗначениеЧислоТипа(0);
	
	РасценкаXDTO.ВсегоПлюс = ЗаполнитьЗначениеЧислоТипа(ПЗ);
	РасценкаXDTO.Оборудование = ЗаполнитьЗначениеЧислоТипа(Оборудование);
	РасценкаXDTO.кЗИМ = ЗаполнитьЗначениеЧислоТипа(Расценка.ЗимнееУдорож);
	
	пЗП = 1;
	пЭМ = 1;
	пЗПМ = 1;
	пЗТР = 1;
	пЗТМ = 1;
	пМР = 1;

	Для каждого Поправка Из Расценка.ПоправкиПозиции Цикл
		Если Не Поправка.Применить Тогда
			Продолжить;
		КонецЕсли;
		пЗП = пЗП * ?(Поправка.КоэффПЗ=0,?(Поправка.КоэффОЗ=0,1,Поправка.КоэффОЗ),Поправка.КоэффПЗ); 
		пЭМ = пЭМ * ?(Поправка.КоэффПЗ=0,?(Поправка.КоэффЭМ=0,1,Поправка.КоэффЭМ),Поправка.КоэффПЗ); 
		пЗПМ = пЗПМ * ?(Поправка.КоэффПЗ=0,?(Поправка.КоэффЗМ=0,1,Поправка.КоэффЗМ),Поправка.КоэффПЗ); 
		пЗТР = пЗТР * ?(Поправка.КоэффПЗ=0,?(Поправка.КоэффТР=0,1,Поправка.КоэффТР),Поправка.КоэффПЗ); 
		пЗТМ = пЗТМ * ?(Поправка.КоэффПЗ=0,?(Поправка.КоэффТМ=0,1,Поправка.КоэффТМ),Поправка.КоэффПЗ); 
		пМР = пМР * ?(Поправка.КоэффПЗ=0,?(Поправка.КоэффСМ=0,1,Поправка.КоэффСМ),Поправка.КоэффПЗ); 
	КонецЦикла;
	                                                     	
	РасценкаXDTO.пЗП = ЗаполнитьЗначениеЧислоТипа(пЗП);
	РасценкаXDTO.пЭМ = ЗаполнитьЗначениеЧислоТипа(пЭМ);
	РасценкаXDTO.пЗПМ = ЗаполнитьЗначениеЧислоТипа(пЗПМ);
	РасценкаXDTO.пЗТР = ЗаполнитьЗначениеЧислоТипа(пЗТР);
	РасценкаXDTO.пЗТМ = ЗаполнитьЗначениеЧислоТипа(пЗТМ);
	РасценкаXDTO.пМР = ЗаполнитьЗначениеЧислоТипа(пМР);
	РасценкаXDTO.пМусор = ЗаполнитьЗначениеЧислоТипа(0);
	
	
	
	Если Расценка.ИДСметы.МетодРасчета = Перечисления.СМ_МетодыРасчетаЛС.БазисноИндексный
		И Расценка.ИДСметы.Уровень = Перечисления.СМ_УровеньЗаданияИндексов.Расценка Тогда
		Затраты = СтоимостьПозицииСКоэффициентамиПересчета(Расценка);
	Иначе
		Затраты = СтоимостьПозицииСНачислениямиПоправкамиИЧП(Расценка);
	КонецЕсли;
	иЗП = ?(Затраты=0,0,Затраты.ЗП)*Объем;
	иЭМ = ?(Затраты=0,0,Затраты.ЭМ)*Объем;
	иЗПМ = ?(Затраты=0,0,Затраты.ЗПМ)*Объем;
	иМР = ?(Затраты=0,0,Затраты.МР)*Объем;
	иЗТР = ?(Затраты=0,0,Затраты.ЗТР)*Объем;
	иЗТМ = ?(Затраты=0,0,Затраты.ЗТМ)*Объем;
	ПЗ = ?(Затраты=0,0,Затраты.ПЗ);
	Оборудование = ?(Затраты=0,0,Затраты.Оборудование*Объем);
	
	иНРСП = ПолучитьИтогиЗатратПозицииНРиСПИтог(Расценка);
	
	иНР = ?(иНРСП = 0,0,иНРСП.НР)*Объем;
	иСП = ?(иНРСП = 0,0,иНРСП.СП)*Объем;
	
	РасценкаXDTO.иЗП = ЗаполнитьЗначениеЧислоТипа(иЗП);
	РасценкаXDTO.иЭМ = ЗаполнитьЗначениеЧислоТипа(иЭМ);
	РасценкаXDTO.иЗПМ = ЗаполнитьЗначениеЧислоТипа(иЗПМ);
	РасценкаXDTO.иЗТР = ЗаполнитьЗначениеЧислоТипа(иЗТР);
	РасценкаXDTO.иЗТМ = ЗаполнитьЗначениеЧислоТипа(иЗТМ);
	РасценкаXDTO.иМР = ЗаполнитьЗначениеЧислоТипа(иМР);
	РасценкаXDTO.иНР = ЗаполнитьЗначениеЧислоТипа(иНР);
	РасценкаXDTO.иСП = ЗаполнитьЗначениеЧислоТипа(иСП);
	
	РасценкаXDTO.иМусор = ЗаполнитьЗначениеЧислоТипа(0);
	РасценкаXDTO.иЗИМ = ЗаполнитьЗначениеЧислоТипа(0);
	РасценкаXDTO.иОборудование = ЗаполнитьЗначениеЧислоТипа(Оборудование);
	
	Для каждого Поправка Из Расценка.ПоправкиПозиции Цикл
		ПоправкаXDTO = ЗаполнитьЗначениеПоправка(Поправка,Расценка); 
		РасценкаXDTO.Поправка.Добавить(ПоправкаXDTO);
	КонецЦикла;

	Если  Расценка.КоэффициентыПересчета.Количество()>0 Тогда
		Индекс = Расценка.КоэффициентыПересчета[0];
		ИндексXDTO = ЗаполнитьЗначениеИндексы(Индекс,Расценка); 
		РасценкаXDTO.Индекс = ИндексXDTO;
	КонецЕсли;
	
	Для каждого Ресурс Из Расценка.РесурсыПозицииЛокальнойСметы Цикл
		РесурсXDTO = ЗаполнитьЗначениеРесурс(Ресурс,Расценка,Объем); 
		РасценкаXDTO.Ресурс.Добавить(РесурсXDTO);
	КонецЦикла;

	Для каждого Работа Из Расценка.СоставРабот Цикл
		РаботаXDTO = ЗаполнитьЗначениеРабота(Работа); 
		РасценкаXDTO.Работа.Добавить(РаботаXDTO);
	КонецЦикла;

	
	Возврат РасценкаXDTO;
КонецФункции

Функция ЗаполнитьЗначениеРабота(Значение) 
	Тип = ФабрикаXDTO.Тип("http://www.estml.ru/estml20.xsd", "Работа");
	ОбъектXDTO = ФабрикаXDTO.Создать(Тип);
	ОбъектXDTO.Наименование = ЗаполнитьЗначениеСтрокТипа(Значение.НаименованиеРаботы);
	Возврат ОбъектXDTO;	
КонецФункции

Функция ЗаполнитьЗначениеРесурс(Ресурс,Расценка,Объем) 
	
	Тип = ФабрикаXDTO.Тип("http://www.estml.ru/estml20.xsd", "Ресурс");
	РесурсXDTO = ФабрикаXDTO.Создать(Тип);
	РесурсXDTO.Шифр = ЗаполнитьЗначениеСтрокТипа(Ресурс.СметныйКодРесурса);
	РесурсXDTO.Наименование = ЗаполнитьЗначениеСтрокТипа(Ресурс.Ресурс.ДлинноеНаименование);
	РесурсXDTO.ЕдИзм = ЗаполнитьЗначениеСтрокТипа(Ресурс.Ресурс.ЕдиницаИзмерения.Наименование);
	
	ДанныеРесурса = ПолучитьДанныеРесурса(Ресурс,Расценка);
	
	РесурсXDTO.Количество = ЗаполнитьЗначениеЧислоТипа(?(ДанныеРесурса=0,0,ДанныеРесурса.Количество));
	РесурсXDTO.Расход = ЗаполнитьЗначениеЧислоТипа(Ресурс.НормаРасхода);
	РесурсXDTO.Возврат = ЗаполнитьЗначениеЧислоТипа(0);
	
	Если Расценка.ИДСметы.МетодРасчета = Перечисления.СМ_МетодыРасчетаЛС.БазисноИндексный Тогда
		Цена = Ресурс.БазиснаяЦена;
	Иначе
		Цена = Ресурс.ТекущаяЦена;
	КонецЕсли;

	РесурсXDTO.Цена = ЗаполнитьЗначениеЧислоТипа(Цена);
	
	кРЕС = 0;
	РесурсXDTO.пРЕС = ЗаполнитьЗначениеЧислоТипа(Ресурс.КоэффициентКРасходуРесурсов);
	РесурсXDTO.кРЕС = ЗаполнитьЗначениеЧислоТипа(кРЕС);
	РесурсXDTO.иРЕС = ЗаполнитьЗначениеЧислоТипа(?(ДанныеРесурса=0,0,ДанныеРесурса.Цена));
	РесурсXDTO.иЗИМр = ЗаполнитьЗначениеЧислоТипа(1);
	РесурсXDTO.кЗИМр = ЗаполнитьЗначениеЧислоТипа(1);
	Возврат РесурсXDTO;	
	
КонецФункции

Функция ЗаполнитьЗначениеИндексы(Индекс,Расценка) 
	Тип = ФабрикаXDTO.Тип("http://www.estml.ru/estml20.xsd", "Коэффициент");
	ИндексXDTO = ФабрикаXDTO.Создать(Тип);
	ИндексXDTO.Шифр = ЗаполнитьЗначениеСтрокТипа(Расценка.ШифрРасценки);
	ИндексXDTO.Наименование = ЗаполнитьЗначениеСтрокТипа(Расценка.Наименование);
	ИндексXDTO.кЗП = ЗаполнитьЗначениеЧислоТипа(Индекс.КоэффОснЗарплаты);
	ИндексXDTO.кЭМ = ЗаполнитьЗначениеЧислоТипа(Индекс.КоэффСтоимЭксплМашин);
	ИндексXDTO.кЗПМ = ЗаполнитьЗначениеЧислоТипа(Индекс.КоэффСтоимЗарплатеМашин);
	ИндексXDTO.кЗТР = ЗаполнитьЗначениеЧислоТипа(1);
	ИндексXDTO.кЗТМ = ЗаполнитьЗначениеЧислоТипа(1);
	ИндексXDTO.кМР = ЗаполнитьЗначениеЧислоТипа(Индекс.КоэффСтоимМатериалов);
	ИндексXDTO.кМусор = ЗаполнитьЗначениеЧислоТипа(0);

	Возврат ИндексXDTO;	
КонецФункции

Функция ЗаполнитьЗначениеПоправка(Поправка,Расценка) 
	Тип = ФабрикаXDTO.Тип("http://www.estml.ru/estml20.xsd", "Поправка");
	ПоправкаXDTO = ФабрикаXDTO.Создать(Тип);
	ПоправкаXDTO.Шифр = ЗаполнитьЗначениеСтрокТипа(Поправка.Обоснование);
	ПоправкаXDTO.Наименование = ЗаполнитьЗначениеСтрокТипа(Поправка.УсловияПрименения);
	ПоправкаXDTO.пЗП = ЗаполнитьЗначениеЧислоТипа(Поправка.КоэффОЗ);
	ПоправкаXDTO.пЭМ = ЗаполнитьЗначениеЧислоТипа(Поправка.КоэффЭМ);
	ПоправкаXDTO.пЗПМ = ЗаполнитьЗначениеЧислоТипа(Поправка.КоэффЗМ);
	ПоправкаXDTO.пЗТР = ЗаполнитьЗначениеЧислоТипа(Поправка.КоэффТР);
	ПоправкаXDTO.пЗТМ = ЗаполнитьЗначениеЧислоТипа(Поправка.КоэффТМ);
	ПоправкаXDTO.пМР = ЗаполнитьЗначениеЧислоТипа(Поправка.КоэффСМ);
	ПоправкаXDTO.пМусор = ЗаполнитьЗначениеЧислоТипа(0);

	Возврат ПоправкаXDTO;	
КонецФункции

Функция ЗаполнитьЗначениеЧислоТипа(Значение) 
	Тип = ФабрикаXDTO.Тип("http://www.estml.ru/estml20.xsd", "tdecimal");
	ОбъектXDTO = ФабрикаXDTO.Создать(Тип);
	ОбъектXDTO.__content = Значение;
	Возврат ОбъектXDTO;	
КонецФункции

Функция ЗаполнитьЗначениеСтрокТипа(Значение) 
	Тип = ФабрикаXDTO.Тип("http://www.estml.ru/estml20.xsd", "tstring");
	ОбъектXDTO = ФабрикаXDTO.Создать(Тип);
	ОбъектXDTO.__content = XMLСтрока(Значение);
	Возврат ОбъектXDTO;	
КонецФункции

Функция ЗаполнитьЗначениеЦелогоТипа(Значение) 
	Тип = ФабрикаXDTO.Тип("http://www.estml.ru/estml20.xsd", "tinteger");
	ОбъектXDTO = ФабрикаXDTO.Создать(Тип);
	ОбъектXDTO.__content = Значение;
	Возврат ОбъектXDTO;	
КонецФункции

Функция ЗаполнитьЗначениеОбъект(Значение)
	
	Тип = ФабрикаXDTO.Тип("http://www.estml.ru/estml20.xsd", "Объект");
	ОбъектXDTO = ФабрикаXDTO.Создать(Тип);
	ОбъектXDTO.Наименование = ЗаполнитьЗначениеСтрокТипа(Значение.Стройка.Наименование);
	ОбъектXDTO.Код = ЗаполнитьЗначениеСтрокТипа(Значение.Стройка.Наименование);
	Возврат ОбъектXDTO;	
	
КонецФункции

Функция ЗаполнитьЗначениеОрганизации(Значение)
	
	Тип = ФабрикаXDTO.Тип("http://www.estml.ru/estml20.xsd", "Организация");
	ОбъектXDTO = ФабрикаXDTO.Создать(Тип);
	ОбъектXDTO.ФИО = ЗаполнитьЗначениеСтрокТипа(Значение.Наименование);
	ОбъектXDTO.Наименование = ЗаполнитьЗначениеСтрокТипа(Значение.Наименование);
	Возврат ОбъектXDTO;	
	
КонецФункции

Функция ЗаполнитьЗначениеИндексов(Значение,Смета)  
	Тип = ФабрикаXDTO.Тип("http://www.estml.ru/estml20.xsd", "СНБ");
	ОбъектXDTO = ФабрикаXDTO.Создать(Тип);
	ОбъектXDTO.Тип = ЗаполнитьЗначениеСтрокТипа(Значение.УровеньБазы);
	ОбъектXDTO.Год = ЗаполнитьЗначениеЦелогоТипа(Год(Смета.ДатаВыпускаИндексов));
	ОбъектXDTO.Месяц = ЗаполнитьЗначениеЦелогоТипа(Месяц(Смета.ДатаВыпускаИндексов));
	ОбъектXDTO.Область = ЗаполнитьЗначениеСтрокТипа(Значение.КодРегиона);
	ОбъектXDTO.Версия = ЗаполнитьЗначениеЦелогоТипа(Значение.Версия);
	Возврат ОбъектXDTO;	
КонецФункции

Функция НайтиРазделы(Смета) 
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СМ_РазделЛокальнойСметы.Ссылка КАК Раздел
	               |ИЗ
	               |	Документ.СМ_РазделЛокальнойСметы КАК СМ_РазделЛокальнойСметы
	               |ГДЕ
	               |	СМ_РазделЛокальнойСметы.ПометкаУдаления = ЛОЖЬ
	               |	И СМ_РазделЛокальнойСметы.ИДСметы = &Смета
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	СМ_РазделЛокальнойСметы.Номер";
	Запрос.УстановитьПараметр("Смета",Смета);
	
	Возврат Запрос.Выполнить().Выбрать();
КонецФункции

Функция НайтиРасценки(Раздел) 
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СМ_ПозицияЛокальнойСметы.Ссылка
	               |ИЗ
	               |	Документ.СМ_ПозицияЛокальнойСметы КАК СМ_ПозицияЛокальнойСметы
	               |ГДЕ
	               |	СМ_ПозицияЛокальнойСметы.ПометкаУдаления = ЛОЖЬ
	               |	И СМ_ПозицияЛокальнойСметы.ИДРодителя = &Раздел
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	СМ_ПозицияЛокальнойСметы.Номер";
	Запрос.УстановитьПараметр("Раздел",Раздел);
	
	Возврат Запрос.Выполнить().Выбрать();
КонецФункции

Функция НайтиАкты(Смета) 
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СМ_АктВыполненныхРабот.Ссылка
	               |ИЗ
	               |	Документ.СМ_АктВыполненныхРабот КАК СМ_АктВыполненныхРабот
	               |ГДЕ
	               |	СМ_АктВыполненныхРабот.Проведен = ИСТИНА
	               |	И СМ_АктВыполненныхРабот.ЛокальнаяСмета = &Смета
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	СМ_АктВыполненныхРабот.НомерАкта";
	Запрос.УстановитьПараметр("Смета",Смета);
	
	Возврат Запрос.Выполнить().Выбрать();
КонецФункции

Функция ПолучитьДанныеРесурса(Ресурс,Расценка)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СМ_СтоимостьРесурсовПозиции.СтоимостьТекущая КАК Цена,
	               |	СМ_СтоимостьРесурсовПозиции.Количество,
	               |	СМ_СтоимостьРесурсовПозиции.СтоимостьБазисная КАК ЦенаБаз
	               |ИЗ
	               |	РегистрСведений.СМ_СтоимостьРесурсовПозиции КАК СМ_СтоимостьРесурсовПозиции
	               |ГДЕ
	               |	СМ_СтоимостьРесурсовПозиции.Позиция = &Расценка
	               |	И СМ_СтоимостьРесурсовПозиции.Ресурс = &Ресурс";
	Запрос.УстановитьПараметр("Расценка",Расценка);
	Запрос.УстановитьПараметр("Ресурс",Ресурс.Ресурс);
	ТЗ = Запрос.Выполнить().Выгрузить();
	Возврат ?(ТЗ.Количество()=0,0,ТЗ[0]);	
КонецФункции	

Функция ПолучитьИтогНачисления(ЛимитированнаяЗатрата,АктСмета)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СМ_ИтогиПоГлавам.ТекПрямЗатраты КАК Итог
	               |ИЗ
	               |	РегистрСведений.СМ_ИтогиПоГлавам КАК СМ_ИтогиПоГлавам
	               |ГДЕ
	               |	СМ_ИтогиПоГлавам.Смета = &Смета
	               |	И СМ_ИтогиПоГлавам.Итог = &ЛимЗатрата";
	Запрос.УстановитьПараметр("ЛимЗатрата",ЛимитированнаяЗатрата);
	Запрос.УстановитьПараметр("Смета",АктСмета);
	ТЗ = Запрос.Выполнить().Выгрузить();
	Возврат ТЗ.Итог("Итог");	

КонецФункции	
	
Функция ПолучитьИтогиЗатратПозицииНРиСП(Расценка) 
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СМ_НРиСП.ТекСуммаНРЕдиничная КАК НР,
	               |	СМ_НРиСП.ТекСуммаСПЕдиничная КАК СП
	               |ИЗ
	               |	РегистрСведений.СМ_НРиСП КАК СМ_НРиСП
	               |ГДЕ
	               |	СМ_НРиСП.Позиция = &Расценка";
	Запрос.УстановитьПараметр("Расценка",Расценка);
	ТЗ = Запрос.Выполнить().Выгрузить();
	Возврат ?(ТЗ.Количество()=0,0,ТЗ[0]);	
КонецФункции

Функция ПолучитьИтогиЗатратПозицииНРиСПИтог(Расценка) 
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СМ_НРиСП.ТекСуммаНРНаОбъем КАК НР,
	               |	СМ_НРиСП.ТекСуммаСПНаОбъем КАК СП
	               |ИЗ
	               |	РегистрСведений.СМ_НРиСП КАК СМ_НРиСП
	               |ГДЕ
	               |	СМ_НРиСП.Позиция = &Расценка";
	Запрос.УстановитьПараметр("Расценка",Расценка);
	ТЗ = Запрос.Выполнить().Выгрузить();
	Возврат ?(ТЗ.Количество()=0,0,ТЗ[0]);	
КонецФункции

Функция СтоимостьПозицииСКоэффициентамиПересчета(Расценка) 
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СМ_БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета.ЗатратыТрудаРабочих КАК ЗТР,
	               |	СМ_БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета.ЗатратыТрудаМашин КАК ЗТМ,
	               |	СМ_БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета.СтоимПрямЗатраты КАК ПЗ,
	               |	СМ_БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета.СтоимОснЗарплата КАК ЗП,
	               |	СМ_БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета.СтоимЭксплМашин КАК ЭМ,
	               |	СМ_БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета.СтоимЗарплМашин КАК ЗПМ,
	               |	СМ_БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета.СтоимСтоимМатер КАК МР,
	               |	СМ_БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета.СтоимОборуд КАК Оборудование
	               |ИЗ
	               |	РегистрСведений.СМ_БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета КАК СМ_БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета
	               |ГДЕ
	               |	СМ_БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета.Позиция = &Расценка";
	Запрос.УстановитьПараметр("Расценка",Расценка);
	ТЗ = Запрос.Выполнить().Выгрузить();
	Возврат ?(ТЗ.Количество()=0,0,ТЗ[0]);	
КонецФункции

Функция СтоимостьПозицииСНачислениямиПоправкамиИЧП(Расценка) 
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СМ_БазиснаяЕдиничнаяСтоимостьПозицииСНачислениямиПоправкамиИЧП.ЗатратыТрудаРабочих КАК ЗТР,
	               |	СМ_БазиснаяЕдиничнаяСтоимостьПозицииСНачислениямиПоправкамиИЧП.ЗатратыТрудаМашин КАК ЗТМ,
	               |	СМ_БазиснаяЕдиничнаяСтоимостьПозицииСНачислениямиПоправкамиИЧП.ТекСтоимПрямЗатраты КАК ПЗ,
	               |	СМ_БазиснаяЕдиничнаяСтоимостьПозицииСНачислениямиПоправкамиИЧП.ТекСтоимОснЗарплата КАК ЗП,
	               |	СМ_БазиснаяЕдиничнаяСтоимостьПозицииСНачислениямиПоправкамиИЧП.ТекСтоимЭксплМашин КАК ЭМ,
	               |	СМ_БазиснаяЕдиничнаяСтоимостьПозицииСНачислениямиПоправкамиИЧП.ТекСтоимЗарплМашин КАК ЗПМ,
	               |	СМ_БазиснаяЕдиничнаяСтоимостьПозицииСНачислениямиПоправкамиИЧП.ТекСтоимСтоимМатер КАК МР,
	               |	СМ_БазиснаяЕдиничнаяСтоимостьПозицииСНачислениямиПоправкамиИЧП.ТекСтоимОборуд КАК Оборудование
	               |ИЗ
	               |	РегистрСведений.СМ_БазиснаяЕдиничнаяСтоимостьПозицииСНачислениямиПоправкамиИЧП КАК СМ_БазиснаяЕдиничнаяСтоимостьПозицииСНачислениямиПоправкамиИЧП
	               |ГДЕ
	               |	СМ_БазиснаяЕдиничнаяСтоимостьПозицииСНачислениямиПоправкамиИЧП.Позиция = &Расценка";
	Запрос.УстановитьПараметр("Расценка",Расценка);
	ТЗ = Запрос.Выполнить().Выгрузить();
	Возврат ?(ТЗ.Количество()=0,0,ТЗ[0]);	
КонецФункции

Функция ПолучитьИтогиЗатратПозиции(Расценка) 
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СМ_РесурснаяСтоимостьПозиции.ТекСтоимПрямЗатраты КАК ПЗ,
	               |	СМ_РесурснаяСтоимостьПозиции.ТекСтоимОснЗарплата КАК ЗП,
	               |	СМ_РесурснаяСтоимостьПозиции.ТекСтоимЭксплМашин КАК ЭМ,
	               |	СМ_РесурснаяСтоимостьПозиции.ТекСтоимЗарплМашин КАК ЗПМ,
	               |	СМ_РесурснаяСтоимостьПозиции.ТекСтоимСтоимМатер КАК МР,
	               |	СМ_РесурснаяСтоимостьПозиции.ЗатратыТрудаРабочих КАК ЗТР,
	               |	СМ_РесурснаяСтоимостьПозиции.ЗатратыТрудаМашин КАК ЗТМ,
	               |	СМ_РесурснаяСтоимостьПозиции.ТекСтоимОборуд КАК Оборудование
	               |ИЗ
	               |	РегистрСведений.СМ_РесурснаяСтоимостьПозиции КАК СМ_РесурснаяСтоимостьПозиции
	               |ГДЕ
	               |	СМ_РесурснаяСтоимостьПозиции.Позиция = &Расценка";
	Запрос.УстановитьПараметр("Расценка",Расценка);
	ТЗ = Запрос.Выполнить().Выгрузить();
	Возврат ?(ТЗ.Количество()=0,0,ТЗ[0]);	
КонецФункции

Функция ПолучитьИтогиЗатрат(Смета,Текст) 
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СМ_ИтогиПоСмете.ТекПрямЗатраты КАК ПЗ,
	               |	СМ_ИтогиПоСмете.ТекОснЗарплата КАК ЗП,
	               |	СМ_ИтогиПоСмете.ТекЭксплМашин КАК ЭМ,
	               |	СМ_ИтогиПоСмете.ТекЗарплМашин КАК ЗПМ,
	               |	СМ_ИтогиПоСмете.ТекСтоимМатер КАК МР,
	               |	СМ_ИтогиПоСмете.ЗатратыТрудаРабочих КАК ЗТР,
	               |	СМ_ИтогиПоСмете.ЗатратыТрудаМашин КАК ЗТМ
	               |ИЗ
	               |	РегистрСведений.СМ_ИтогиПоСмете КАК СМ_ИтогиПоСмете
	               |ГДЕ
	               |	СМ_ИтогиПоСмете.Смета = &Смета
	               |	И СМ_ИтогиПоСмете.Итог = " + Текст;
	Запрос.УстановитьПараметр("Смета",Смета);
	ТЗ = Запрос.Выполнить().Выгрузить();
	Возврат ?(ТЗ.Количество()=0,0,ТЗ[0]);	
КонецФункции

Функция ПолучитьИтогиЗатратРаздела(Раздел,Смета,Текст) 
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СМ_ИтогиПоРазделу.ТекПрямЗатраты КАК ПЗ,
	               |	СМ_ИтогиПоРазделу.ТекОснЗарплата КАК ЗП,
	               |	СМ_ИтогиПоРазделу.ТекЭксплМашин КАК ЭМ,
	               |	СМ_ИтогиПоРазделу.ТекЗарплМашин КАК ЗПМ,
	               |	СМ_ИтогиПоРазделу.ТекСтоимМатер КАК МР,
	               |	СМ_ИтогиПоРазделу.ЗатратыТрудаРабочих КАК ЗТР,
	               |	СМ_ИтогиПоРазделу.ЗатратыТрудаМашин КАК ЗТМ
	               |ИЗ
	               |	РегистрСведений.СМ_ИтогиПоРазделу КАК СМ_ИтогиПоРазделу
	               |ГДЕ
	               |	СМ_ИтогиПоРазделу.Смета = &Смета И СМ_ИтогиПоРазделу.Раздел = &Раздел
	               |	И СМ_ИтогиПоРазделу.Итог = " + Текст;
	Запрос.УстановитьПараметр("Смета",Смета);
	Запрос.УстановитьПараметр("Раздел",Раздел);

	ТЗ = Запрос.Выполнить().Выгрузить();
	Возврат ?(ТЗ.Количество()=0,0,ТЗ[0]);	
КонецФункции

Функция ПолучитьИтогиВидыРабот(Смета,Текст) 
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СМ_ИтогиПоВидамРабот.ТекПрямЗатраты КАК ПЗ
	               |ИЗ
	               |	РегистрСведений.СМ_ИтогиПоВидамРабот КАК СМ_ИтогиПоВидамРабот
	               |ГДЕ
	               |	СМ_ИтогиПоВидамРабот.Смета = &Смета
	               |	И СМ_ИтогиПоВидамРабот.Итог =" + Текст;
	Запрос.УстановитьПараметр("Смета",Смета);
	ТЗ = Запрос.Выполнить().Выгрузить();
	Возврат ?(ТЗ.Количество()=0,ЗаполнитьЗначениеЧислоТипа(0),ЗаполнитьЗначениеЧислоТипа(ТЗ[0].ПЗ));	
КонецФункции

#КонецОбласти

#Область Загрузка
// // // // /Загрузка// // // // // // // /

// Процедура загружает Локальную смету из указанного файла.
// ПАРАМЕТРЫ:
// // Путь - путь к файлу сметы.
Процедура ПрочитатьНаСервере(Путь) Экспорт
	
	ИмяФайла = ПолучитьИмяВременногоФайла("xsd");
	Макет = ПолучитьМакет("Схема");
	Макет.Записать(ИмяФайла);
	
	ИмяФайла1 = ПолучитьИмяВременногоФайла("xsd");
	Макет = ПолучитьМакет("СхемаНастройка");
	Макет.Записать(ИмяФайла1);

	Схемы = Новый Массив;
	Схемы.Добавить(ИмяФайла);
	Схемы.Добавить(ИмяФайла1);

	ЕстьАкт = Ложь;

	Фабрика = СоздатьФабрикуXDTO(Схемы);

	ИмяВременногоФайла = ПолучитьИмяВременногоФайла();
	Запись = РегистрыСведений.СМ_Файлы.Выбрать(Новый Структура("ИмяФайла",Путь)); 
	Запись.Следующий();
	ДвоичныеДанные = Запись.Файл.Получить();
	ДвоичныеДанные.Записать(ИмяВременногоФайла);

	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.ОткрытьФайл(ИмяВременногоФайла);
	
	ФайлОбъектXDTO = Фабрика.ПрочитатьXML(ЧтениеXML);
	
	НоваяСмета 				= Документы.СМ_ЛокальнаяСмета.СоздатьДокумент();
	НоваяСмета.НомерСметы 	= ФайлОбъектXDTO.ЛокальнаяСмета.Номер;
	НоваяСмета.Дата			= ПреобразоватьФорматДаты(ФайлОбъектXDTO.ЛокальнаяСмета.Дата);
	//НоваяСмета.Дата 		= Дата(Сред(ФайлОбъектXDTO.ЛокальнаяСмета.Дата,7),Сред(ФайлОбъектXDTO.ЛокальнаяСмета.Дата,4,2),Лев(ФайлОбъектXDTO.ЛокальнаяСмета.Дата,2));
	
	Если Не ФайлОбъектXDTO.ЛокальнаяСмета.свойства().получить("Заказчик") = Неопределено Тогда
		Если Не ФайлОбъектXDTO.ЛокальнаяСмета.Заказчик.свойства().получить("Наименование")  = Неопределено Тогда
			НоваяСмета.Заказчик = Справочники.Контрагенты.НайтиПоНаименованию(ФайлОбъектXDTO.ЛокальнаяСмета.Заказчик.Наименование,Истина);
		КонецЕсли;
	КонецЕсли;
	
	Если Не ФайлОбъектXDTO.ЛокальнаяСмета.свойства().получить("Подрядчик") = Неопределено Тогда
		Если Не ФайлОбъектXDTO.ЛокальнаяСмета.Подрядчик.свойства().получить("Наименование")  = Неопределено Тогда
			НоваяСмета.Подрядчик = Справочники.Контрагенты.НайтиПоНаименованию(ФайлОбъектXDTO.ЛокальнаяСмета.Подрядчик.Наименование,Истина);
		КонецЕсли;
	КонецЕсли;
	
	Если Не ФайлОбъектXDTO.ЛокальнаяСмета.свойства().получить("ПроектнаяОрганизация") = Неопределено Тогда
		Если Не ФайлОбъектXDTO.ЛокальнаяСмета.ПроектнаяОрганизация.свойства().получить("Наименование")  = Неопределено Тогда
			НоваяСмета.Организация = Справочники.Организации.НайтиПоНаименованию(ФайлОбъектXDTO.ЛокальнаяСмета.ПроектнаяОрганизация.Наименование,Истина);
		КонецЕсли;
	КонецЕсли;
	
	Если Не ФайлОбъектXDTO.ЛокальнаяСмета.свойства().получить("Инвестор") = Неопределено Тогда
		Если Не ФайлОбъектXDTO.ЛокальнаяСмета.Инвестор.свойства().получить("ФИО")  = Неопределено Тогда
			НоваяСмета.Инвестор = Справочники.Контрагенты.НайтиПоНаименованию(ФайлОбъектXDTO.ЛокальнаяСмета.Инвестор.ФИО,Истина);
		КонецЕсли;
	КонецЕсли;
	
	НоваяСмета.Стройка = Справочники.СМ_ОбъектыСтроительства.НайтиПоНаименованию(ФайлОбъектXDTO.ЛокальнаяСмета.Объект.Наименование,Истина);
	НоваяСмета.Наименование = ФайлОбъектXDTO.ЛокальнаяСмета.Объект.Наименование;
	НоваяСмета.МетодРасчета = Перечисления.СМ_МетодыРасчетаЛС.БазисноИндексный;
	НоваяСмета.Уровень = Перечисления.СМ_УровеньЗаданияИндексов.Расценка;
	НоваяСмета.СпособРасчетаИндексов = Перечисления.СМ_СпособыРасчетаИндексов.ПоЭлементамЗатрат;
	НоваяСмета.Записать();
	
	Если Не ФайлОбъектXDTO.ЛокальнаяСмета.свойства().получить("Раздел") = Неопределено Тогда
		Если ТипЗнч(ФайлОбъектXDTO.ЛокальнаяСмета.Раздел) = Тип("СписокXDTO") Тогда
			Для каждого СтрРаздел Из ФайлОбъектXDTO.ЛокальнаяСмета.Раздел Цикл
				СоздатьРаздел(СтрРаздел,НоваяСмета);
			КонецЦикла;
		Иначе
			СоздатьРаздел(ФайлОбъектXDTO.ЛокальнаяСмета.Раздел,НоваяСмета);
		КонецЕсли;
	КонецЕсли;
	
	Если ПолучитьФункциональнуюОпцию("СМ_ИспользованиеУчетаВыполненныхРабот") Тогда
		Если Не ФайлОбъектXDTO.ЛокальнаяСмета.свойства().получить("Акт") = Неопределено Тогда
			Если ТипЗнч(ФайлОбъектXDTO.ЛокальнаяСмета.Акт) = Тип("СписокXDTO") Тогда
				Для каждого СтрАкт Из ФайлОбъектXDTO.ЛокальнаяСмета.Акт Цикл
					СоздатьАкт(СтрАкт,НоваяСмета);
					ЕстьАкт = Истина;
				КонецЦикла;
			Иначе
				СоздатьАкт(ФайлОбъектXDTO.ЛокальнаяСмета.Акт,НоваяСмета);
				ЕстьАкт = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если Не ФайлОбъектXDTO.ЛокальнаяСмета.свойства().получить("Начисление") = Неопределено Тогда
		Если ТипЗнч(ФайлОбъектXDTO.ЛокальнаяСмета.Начисление) = Тип("СписокXDTO") Тогда
			Для каждого СтрНачисление Из ФайлОбъектXDTO.ЛокальнаяСмета.Начисление Цикл
				НовоеНачисление = НоваяСмета.ЛимитированныеЗатраты.Добавить();
				НовоеНачисление.ЛимитированнаяЗатрата = Справочники.СМ_ЛимитированныеЗатраты.НайтиПоНаименованию(СтрНачисление.Наименование,Истина);
				НовоеНачисление.ЗначениеЛимЗатраты = СтрНачисление.Значение;
			КонецЦикла;
		Иначе
			НовоеНачисление = НоваяСмета.ЛимитированныеЗатраты.Добавить();
			НовоеНачисление.ЛимитированнаяЗатрата = Справочники.СМ_ЛимитированныеЗатраты.НайтиПоНаименованию(ФайлОбъектXDTO.ЛокальнаяСмета.Начисление.Наименование,Истина);
			НовоеНачисление.ЗначениеЛимЗатраты = ФайлОбъектXDTO.ЛокальнаяСмета.Начисление.Значение;
		КонецЕсли;
	КонецЕсли;

	Если СМ_СметаВызовСервера.ЗначениеОпции("СМ_ИспользоватьСтатусыДокументов") И ЕстьАкт Тогда
		НоваяСмета.Статус = Перечисления.СМ_СтатусыСметныхДокументов.Согласован;
	КонецЕсли;
	
	НоваяСмета.Записать();
	
	//ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='Создан новый документ - %1'"), Строка(НоваяСмета)));    
	
	// Запись сообщений в журнал регистрации
	СтруктураСообщения 	= Новый Структура;
	СтруктураСообщения.Вставить("ИмяСобытия",НСтр("ru='Обмен в формате ESTML'"));
	СтруктураСообщения.Вставить("ПредставлениеУровня",НСтр("ru='Информация'"));
	СтруктураСообщения.Вставить("Комментарий",СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='Создан новый документ - %1'"), Строка(НоваяСмета)));
	СтруктураСообщения.Вставить("ДатаСобытия",ТекущаяДатаСеанса());
	
	СообщенияДляЖурнала	= Новый СписокЗначений();
	СообщенияДляЖурнала.Добавить(СтруктураСообщения);
	ЖурналРегистрации.ЗаписатьСобытияВЖурналРегистрации(СообщенияДляЖурнала);

КонецПроцедуры

Функция ПреобразоватьФорматДаты(ТекДата)
	
	// формат даты: 2015-02-06T15:42:00
    ПозицияТ = СтрНайти(ТекДата,"T");
	Если ПозицияТ > 0 Тогда
		ТекДата 	= Сред(ТекДата,1,ПозицияТ-1);
		НоваяДата 	= Дата(Сред(ТекДата,1,4),Сред(ТекДата,6,2),Сред(ТекДата,9));
	// формат даты: 15.04.2013
	Иначе	
		НоваяДата = Дата(Сред(ТекДата,7),Сред(ТекДата,4,2),Лев(ТекДата,2));
	КонецЕсли;
	
	Возврат НоваяДата;
	
КонецФункции

Процедура СоздатьАкт(Акт,Смета)
	
	СообщенияДляЖурнала	= Новый СписокЗначений();
	
	НовыйАкт 		= Документы.СМ_АктВыполненныхРабот.СоздатьДокумент();
	НовыйАкт.Дата 	= XMLЗначение(Тип("Дата"), Акт.Дата);
	НовыйАкт.Организация = Смета.Организация;
	НовыйАкт.ЛокальнаяСмета = Смета.Ссылка;
	Если Не Акт.свойства().получить("Заказчик") = Неопределено Тогда
		НовыйАкт.Заказчик = Справочники.Контрагенты.НайтиПоНаименованию(Акт.Заказчик.Наименование,Истина);
	КонецЕсли;
	Если Не Акт.свойства().получить("Подрядчик") = Неопределено Тогда
		НовыйАкт.Подрядчик = Справочники.Контрагенты.НайтиПоНаименованию(Акт.Подрядчик.Наименование,Истина);
	КонецЕсли;
	Если Не Акт.свойства().получить("Инвестор") = Неопределено Тогда
		НовыйАкт.Инвестор = Справочники.Контрагенты.НайтиПоНаименованию(Акт.Инвестор.Наименование,Истина);
	КонецЕсли;
	НовыйАкт.Стройка = Справочники.СМ_ОбъектыСтроительства.НайтиПоНаименованию(Акт.Объект.Наименование,Истина);
	НовыйАкт.Записать();
	Если Не Акт.свойства().получить("Раздел") = Неопределено Тогда
		СоздРаздел = Неопределено;
		Если ТипЗнч(Акт.Раздел) = Тип("СписокXDTO") Тогда
			Для каждого СтрРаздел Из Акт.Раздел Цикл
				СоздРаздел = НайтиРаздел(СтрРаздел,Смета,НовыйАкт);
				Если СоздРаздел = Неопределено Тогда
					//ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='Не найден раздел %1'"), СтрРаздел.Наименование));
					СтруктураСообщения 	= Новый Структура;
					СтруктураСообщения.Вставить("ИмяСобытия",НСтр("ru='Обмен в формате ESTML'"));
					СтруктураСообщения.Вставить("ПредставлениеУровня",НСтр("ru='Ошибка'"));
					СтруктураСообщения.Вставить("Комментарий",СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='Не найден раздел %1'"), СтрРаздел.Наименование));
					СтруктураСообщения.Вставить("ДатаСобытия",ТекущаяДатаСеанса());
					СообщенияДляЖурнала.Добавить(СтруктураСообщения);
					Продолжить;
				КонецЕсли;
				НовРаздел = НовыйАкт.Разделы.Добавить();
				НовРаздел.Раздел = СоздРаздел.Ссылка;
			КонецЦикла;
		Иначе
			СоздРаздел = НайтиРаздел(Акт.Раздел,Смета,НовыйАкт); 
			Если СоздРаздел = Неопределено Тогда
				//ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='Не найден раздел %1'"), Акт.Раздел.Наименование));
				СтруктураСообщения 	= Новый Структура;
				СтруктураСообщения.Вставить("ИмяСобытия",НСтр("ru='Обмен в формате ESTML'"));
				СтруктураСообщения.Вставить("ПредставлениеУровня",НСтр("ru='Ошибка'"));
				СтруктураСообщения.Вставить("Комментарий",СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='Не найден раздел %1'"), Акт.Раздел.Наименование));
				СтруктураСообщения.Вставить("ДатаСобытия",ТекущаяДатаСеанса());
				СообщенияДляЖурнала.Добавить(СтруктураСообщения);
			Иначе
				НовРаздел 			= НовыйАкт.Разделы.Добавить();
				НовРаздел.Раздел 	= СоздРаздел.Ссылка;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	// Запись сообщений в журнал регистрации
	ЖурналРегистрации.ЗаписатьСобытияВЖурналРегистрации(СообщенияДляЖурнала);
	
	Если Не Акт.свойства().получить("Начисление") = Неопределено Тогда
		Если ТипЗнч(Акт.Начисление) = Тип("СписокXDTO") Тогда
			Для каждого СтрНачисление Из Акт.Начисление Цикл
				НовыйАкт = НовыйАкт.ЛимитированныеЗатраты.Добавить();
				НовыйАкт.ЛимитированнаяЗатрата = Справочники.СМ_ЛимитированныеЗатраты.НайтиПоНаименованию(СтрНачисление.Наименование,Истина);
				НовыйАкт.ЗначениеЛимЗатраты = СтрНачисление.Значение;
			КонецЦикла;
		Иначе
			НовыйАкт = НовыйАкт.ЛимитированныеЗатраты.Добавить();
			НовыйАкт.ЛимитированнаяЗатрата = Справочники.СМ_ЛимитированныеЗатраты.НайтиПоНаименованию(Акт.Начисление.Наименование,Истина);
			НовыйАкт.ЗначениеЛимЗатраты = Акт.Начисление.Значение;
		КонецЕсли;
	КонецЕсли;

	НовыйАкт.Записать();
	
КонецПроцедуры

Функция НайтиРаздел(СтрРаздел,Смета,НовыйАкт)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СМ_РазделЛокальнойСметы.Ссылка
	               |ИЗ
	               |	Документ.СМ_РазделЛокальнойСметы КАК СМ_РазделЛокальнойСметы
	               |ГДЕ
	               |	СМ_РазделЛокальнойСметы.ИДСметы = &Смета
	               |	И СМ_РазделЛокальнойСметы.НаименованиеДляПечати ПОДОБНО &Наименование";
	Запрос.УстановитьПараметр("Смета",Смета.Ссылка);
	Запрос.УстановитьПараметр("Наименование",СтрРаздел.Наименование);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Раздел = Выборка.Ссылка;
	Иначе
		Возврат Неопределено; 
	КонецЕсли;
	
	СообщенияДляЖурнала	= Новый СписокЗначений();
	
	Если ТипЗнч(СтрРаздел.Расценка) = Тип("СписокXDTO") Тогда
		Для каждого СтрРасценка Из СтрРаздел.Расценка Цикл
			Позиция = НайтиПозицию(СтрРасценка,Раздел,Смета);
			Если Позиция = Неопределено Тогда
				//ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='Не найдена позиция %1'"), СтрРасценка.Шифр));
				СтруктураСообщения 	= Новый Структура;
				СтруктураСообщения.Вставить("ИмяСобытия",НСтр("ru='Обмен в формате ESTML'"));
				СтруктураСообщения.Вставить("ПредставлениеУровня",НСтр("ru='Ошибка'"));
				СтруктураСообщения.Вставить("Комментарий",СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='Не найдена позиция %1'"), СтрРасценка.Шифр));
				СтруктураСообщения.Вставить("ДатаСобытия",ТекущаяДатаСеанса());
				СообщенияДляЖурнала.Добавить(СтруктураСообщения);
				Продолжить;
			КонецЕсли;
			НовПозиция = НовыйАкт.Позиции.Добавить();
			НовПозиция.Позиция = Позиция.ссылка;
			НовПозиция.ФактОбъем = СтрРасценка.Количество;
		КонецЦикла;
	Иначе
		Позиция = НайтиПозицию(СтрРаздел.Расценка,Раздел,Смета);
		Если Позиция = Неопределено Тогда
			//ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='Не найдена позиция %1'"), СтрРаздел.Расценка.Шифр));
			СтруктураСообщения 	= Новый Структура;
			СтруктураСообщения.Вставить("ИмяСобытия",НСтр("ru='Обмен в формате ESTML'"));
			СтруктураСообщения.Вставить("ПредставлениеУровня",НСтр("ru='Ошибка'"));
			СтруктураСообщения.Вставить("Комментарий",СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='Не найдена позиция %1'"), СтрРаздел.Расценка.Шифр));
			СтруктураСообщения.Вставить("ДатаСобытия",ТекущаяДатаСеанса());
	        СообщенияДляЖурнала.Добавить(СтруктураСообщения);
		Иначе
			НовПозиция = НовыйАкт.Позиции.Добавить();
			НовПозиция.Позиция = Позиция.ссылка;
			НовПозиция.ФактОбъем = СтрРаздел.Расценка.Количество;
		КонецЕсли;
	КонецЕсли;
	
	// Запись сообщений в журнал регистрации
	ЖурналРегистрации.ЗаписатьСобытияВЖурналРегистрации(СообщенияДляЖурнала);
	
	Возврат Раздел; 
	
КонецФункции

Функция НайтиПозицию(СтрРасценка,Раздел,Смета)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СМ_ПозицияЛокальнойСметы.Ссылка
	               |ИЗ
	               |	Документ.СМ_ПозицияЛокальнойСметы КАК СМ_ПозицияЛокальнойСметы
	               |ГДЕ
	               |	СМ_ПозицияЛокальнойСметы.ИДСметы = &Смета
	               |	И СМ_ПозицияЛокальнойСметы.ИДРодителя = &Раздел
	               |	И СМ_ПозицияЛокальнойСметы.ШифрРасценки = &Шифр
	               |	И СМ_ПозицияЛокальнойСметы.Наименование ПОДОБНО &Наименование";
	Запрос.УстановитьПараметр("Смета",Смета.Ссылка);
	Запрос.УстановитьПараметр("Наименование",СтрРасценка.Наименование);
	Запрос.УстановитьПараметр("Раздел",Раздел.Ссылка);
	Запрос.УстановитьПараметр("Шифр",СтрРасценка.Шифр);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	Иначе
		Возврат Неопределено; 
	КонецЕсли;
КонецФункции

Процедура СоздатьРаздел(Раздел,СметаАкт)
	НовыйРаздел = Документы.СМ_РазделЛокальнойСметы.СоздатьДокумент();
	НовыйРаздел.Расчет = Истина;
	НовыйРаздел.Дата = СметаАкт.Дата;
	НовыйРаздел.ИДРодителя = СметаАкт.Ссылка;
	НовыйРаздел.ИДСметы = СметаАкт.Ссылка;
	НовыйРаздел.НаименованиеДляПечати = Раздел.Наименование;
	НовыйРаздел.Записать();
	Если Раздел.Свойства().Получить("Расценка") = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Если ТипЗнч(Раздел.Расценка) = Тип("СписокXDTO") Тогда
		Для каждого СтрРасценка Из Раздел.Расценка Цикл
			СоздатьПозицию(СтрРасценка,НовыйРаздел,СметаАкт);
		КонецЦикла;
	Иначе
		СоздатьПозицию(Раздел.Расценка,НовыйРаздел,СметаАкт);
	КонецЕсли;
КонецПроцедуры

Процедура СоздатьПозицию(Расценка,Раздел,СметаАкт)
	
	НовыйПозиция = Документы.СМ_ПозицияЛокальнойСметы.СоздатьДокумент(); 
	НовыйПозиция.Расчет = Истина;
	НовыйПозиция.Дата = СметаАкт.Дата;
	НовыйПозиция.ИДРодителя = Раздел.Ссылка;
	НовыйПозиция.ИДСметы = Раздел.ИДСметы;
	НовыйПозиция.ШифрРасценки = Расценка.Шифр;
	НовыйПозиция.Наименование = Расценка.Наименование;
	НовыйПозиция.ЕдиницаИзмерения = Справочники.СМ_ЕдиницыИзмеренияСмета.НайтиПоНаименованию(Расценка.ЕдИзм,Истина);
	НовыйПозиция.ОбъемРабот = Расценка.Количество;
	НовыйПозиция.Определитель = Справочники.СМ_Определители.НайтиПоНаименованию("Общестроительные работы",Истина);
	
	НовыйПозиция.ОснЗарплата = Расценка.ЗП;
	НовыйПозиция.ЭксплМашин = Расценка.ЭМ;
	НовыйПозиция.ТекущаяЗарплатаМашинистов = Расценка.ЗПМ;
	НовыйПозиция.СтоимМатериалов = Расценка.МР;
	НовыйПозиция.ЗатратыТрудаРабочих = Расценка.ЗТР;
	НовыйПозиция.ЗатратыТрудаМашинистов = Расценка.ЗТМ;
	НовыйПозиция.ПрямЗатраты = Расценка.Всего;
	НовыйПозиция.Оборудование = Расценка.Оборудование;
	НовыйПозиция.НакладныеРасходыТекущие = Расценка.НР;
	НовыйПозиция.СметнаяПрибыльТекущие = Расценка.СП;
	
	НовыйПозиция.СпособСоздания  	= Перечисления.СМ_ИсточникиДобавленияПозиций.Загружена;
	НовыйПозиция.ИсточникСоздания   = "ГосСтройСмета#ESTML";
	
	Если Не Расценка.свойства().получить("Поправка") = Неопределено Тогда
		Если ТипЗнч(Расценка.Поправка) = Тип("СписокXDTO") Тогда
			Для каждого СтрПоправка Из Расценка.Поправка Цикл
				НовПоправка 					= НовыйПозиция.ПоправкиПозиции.Добавить();
				НовПоправка.Обоснование 		= ?(ТипЗнч(СтрПоправка.Шифр) = Тип("ОбъектXDTO"),"",СтрПоправка.Шифр);
				НовПоправка.УсловияПрименения 	= ?(ТипЗнч(СтрПоправка.Наименование) = Тип("ОбъектXDTO"),"",СтрПоправка.Наименование);
				НовПоправка.КоэффОЗ 			= СтрПоправка.пЗП;
				НовПоправка.КоэффЭМ 			= СтрПоправка.пЭМ;
				НовПоправка.КоэффЗМ 			= СтрПоправка.пЗПМ;
				НовПоправка.КоэффТР 			= СтрПоправка.пЗТР;
				НовПоправка.КоэффТМ 			= СтрПоправка.пЗТМ;
				НовПоправка.КоэффСМ 			= СтрПоправка.пМР;
				НовПоправка.ТипПоправки 		= Перечисления.СМ_ТипыПоправок.ТехчастиСборников;
			КонецЦикла;
		Иначе
			СтрПоправка =  Расценка.Поправка;
			НовПоправка = НовыйПозиция.ПоправкиПозиции.Добавить();
			НовПоправка.Обоснование = ?(ТипЗнч(СтрПоправка.Шифр) = Тип("ОбъектXDTO"),"",СтрПоправка.Шифр);
			НовПоправка.УсловияПрименения =  ?(ТипЗнч(СтрПоправка.Наименование) = Тип("ОбъектXDTO"),"",СтрПоправка.Наименование);
			НовПоправка.КоэффОЗ = СтрПоправка.пЗП;
			НовПоправка.КоэффЭМ = СтрПоправка.пЭМ;
			НовПоправка.КоэффЗМ = СтрПоправка.пЗПМ;
			НовПоправка.КоэффТР = СтрПоправка.пЗТР;
			НовПоправка.КоэффТМ = СтрПоправка.пЗТМ;
			НовПоправка.КоэффСМ = СтрПоправка.пМР;
			НовПоправка.ТипПоправки = Перечисления.СМ_ТипыПоправок.ТехчастиСборников;
		КонецЕсли;
	КонецЕсли;
	Если Не Расценка.свойства().получить("Ресурс") = Неопределено Тогда
		Если ТипЗнч(Расценка.Ресурс) = Тип("СписокXDTO") Тогда
			Для каждого СтрРесурс Из Расценка.Ресурс Цикл
				НовРесурс = НовыйПозиция.РесурсыПозицииЛокальнойСметы.Добавить();
				НовРесурс.СметныйКодРесурса =  СтрРесурс.Шифр;
				НовРесурс.Ресурс =	Справочники.СМ_Ресурсы.НайтиПоКоду(СтрРесурс.Шифр);
				НовРесурс.НормаРасхода = СтрРесурс.Расход;
				НовРесурс.ТекущаяЦена = СтрРесурс.Цена;
				НовРесурс.КоэффициентКРасходуРесурсов = СтрРесурс.пРЕС;
				НовРесурс.НаименованиеРесурса = НовРесурс.Ресурс.ДлинноеНаименование;
				НовРесурс.ЕдиницаИзмеренияРесурса = НовРесурс.Ресурс.ЕдиницаИзмерения;
			КонецЦикла;
		Иначе
			СтрРесурс = Расценка.Ресурс;
			НовРесурс = НовыйПозиция.РесурсыПозицииЛокальнойСметы.Добавить();
			НовРесурс.СметныйКодРесурса =  СтрРесурс.Шифр;
			НовРесурс.Ресурс =	Справочники.СМ_Ресурсы.НайтиПоКоду(СтрРесурс.Шифр);
			НовРесурс.НормаРасхода = СтрРесурс.Расход;
			НовРесурс.ТекущаяЦена = СтрРесурс.Цена;
			НовРесурс.КоэффициентКРасходуРесурсов = СтрРесурс.пРЕС;
			НовРесурс.НаименованиеРесурса = НовРесурс.Ресурс.ДлинноеНаименование;
			НовРесурс.ЕдиницаИзмеренияРесурса = НовРесурс.Ресурс.ЕдиницаИзмерения;
		КонецЕсли;
	КонецЕсли;
	
	Если Не Расценка.свойства().получить("Работа") = Неопределено Тогда
		Если ТипЗнч(Расценка.Работа) = Тип("СписокXDTO") Тогда
			Для каждого СтрРабота Из Расценка.Работа Цикл
				НовРабота = НовыйПозиция.СоставРабот.Добавить();
				НовРабота.НаименованиеРаботы = СтрРабота.Наименование;
			КонецЦикла;
		Иначе
			СтрРабота = Расценка.Работа;
			НовРабота = НовыйПозиция.СоставРабот.Добавить();
			НовРабота.НаименованиеРаботы = СтрРабота.Наименование;
		КонецЕсли;
	КонецЕсли;         
	
	Если Не Расценка.свойства().получить("Индекс") = Неопределено Тогда
		Индекс = НовыйПозиция.КоэффициентыПересчета.Добавить();
		Индекс.ВариантПересчетаЭММ = ОбщегоНазначенияВызовСервера.ХранилищеОбщихНастроекЗагрузить("НастройкиПользователяСмета","ВариантПересчетаЭММ");
		Индекс.КоэффОснЗарплаты = Расценка.Индекс.кЗП ;
		Индекс.КоэффСтоимЭксплМашин = Расценка.Индекс.кЭМ;
		Индекс.КоэффСтоимЗарплатеМашин = Расценка.Индекс.кЗПМ;
		Индекс.КоэффСтоимМатериалов = Расценка.Индекс.кМР;
	КонецЕсли;
	
	НовыйПозиция.Записать();

КонецПроцедуры

#КонецОбласти

#КонецЕсли
